app/views/stocks/_stock.html.erb

<%= flash[:notice] if flash[:notice] %>
<p><%= link_to stock.symbol, stock_path(stock.id) %> (<%= Company.find(stock.company_id).name %>)<br></p>
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]