app/views/pages/home.html.erb

SELECT "trades".* FROM "trades" ORDER BY "trades"."id" ASC LIMIT ?  [["LIMIT", 1]]
---

<% if Trade.first %>

SELECT "trades".* FROM "trades"
---
  <% recent_trades=[] %>
  <% Trade.all.each do |trade| %>

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---

<h1> <%= Stock.find(popular.stock_id).symbol %></h1>