app/controllers/application_controller.rb

  def current_user
    @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "tVy57nDAPHlqBbLTqKHAGcpIGQuWMoIu4wba4iPg2kxoOvbVaG3n4ofVHfwiw98MUjYCeWh+zi0pMGSHN3A+KA=="], ["LIMIT", 1]]