app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings" WHERE "listings"."status" = ?  [["status", 0]]
---
    def index
       @listings = Listing.where(status: 'active')

INSERT INTO "listings" ("seller_id", "stock_id", "amount", "created_at", "updated_at", "price_cents") VALUES (?, ?, ?, ?, ?, ?)  [["seller_id", 1], ["stock_id", 1], ["amount", 3], ["created_at", "2020-07-09 21:04:36.652659"], ["updated_at", "2020-07-09 21:04:36.652659"], ["price_cents", 300]]
UPDATE "listings" SET "updated_at" = ?, "status" = ? WHERE "listings"."id" = ?  [["updated_at", "2020-07-09 21:04:36.658105"], ["status", 1], ["id", 7]]
INSERT INTO "listings" ("seller_id", "stock_id", "amount", "created_at", "updated_at", "price_cents", "status") VALUES (?, ?, ?, ?, ?, ?, ?)  [["seller_id", 1], ["stock_id", 1], ["amount", 3], ["created_at", "2020-07-10 22:25:49.987668"], ["updated_at", "2020-07-10 22:25:49.987668"], ["price_cents", 300], ["status", 0]]
---
    def create
        @listing = Listing.create(listings_params)

        if @listing.verify_listing(params[:listing][:stock_id]) && @listing.save!

SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @listing = Listing.find(params[:id])