app/controllers/trades_controller.rb

SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @user = current_user
    @listing = Listing.find(params[:listing_id])

SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "trades" ("buyer_id", "listing_id", "date", "created_at", "updated_at", "purchase_price_cents") VALUES (?, ?, ?, ?, ?, ?)  [["buyer_id", 1], ["listing_id", 1], ["date", "-4712-01-01 00:00:00"], ["created_at", "2020-07-09 21:31:59.353275"], ["updated_at", "2020-07-09 21:31:59.353275"], ["purchase_price_cents", 43400]]
INSERT INTO "owned_by_users" ("amount", "created_at", "updated_at", "purchase_price_cents", "user_id", "stock_id", "stock_symbol") VALUES (?, ?, ?, ?, ?, ?, ?)  [["amount", 4], ["created_at", "2020-07-10 03:15:45.133427"], ["updated_at", "2020-07-10 03:15:45.133427"], ["purchase_price_cents", 3300], ["user_id", 3], ["stock_id", 1], ["stock_symbol", "AAPL"]]
UPDATE "users" SET "account_balance_cents" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["account_balance_cents", 1998567800], ["updated_at", "2020-07-09 20:30:41.518216"], ["id", 1]]
UPDATE "listings" SET "status" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["status", 1], ["updated_at", "2020-07-09 23:05:32.558182"], ["id", 1]]
---
  def create
    @listing = Listing.find(params[:listing_id])
    @user = User.find(params[:user])

    if @user.account_balance >= @listing.total_listing_price

      @trade = Trade.create!(
          listing_id: @listing.id,
          buyer_id: @user.id,
          date: Date.new,
          purchase_price: @listing.price
      )

      OwnedByUser.create_or_update(@user, @listing)
      @trade.save!
      @user.buy_stock(@trade)
      @listing.seller.sell_stock(@trade)
      @listing.update!(status: 1)