app/controllers/users_controller.rb

UPDATE "users" SET "account_balance_cents" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["account_balance_cents", 1000000], ["updated_at", "2020-07-09 22:41:40.953568"], ["id", 3]]
---
  def update
    if params[:user][:account_balance]
      current_user.update_account(current_user, params[:user][:account_balance])

INSERT INTO "users" ("first_name", "last_name", "username", "created_at", "updated_at", "password_digest", "session_token") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    sign_in!(@user) if @user.save