app/models/listing.rb

SELECT "listings".* FROM "listings" WHERE "listings"."status" = ?  [["status", 0]]
---
  def self.active_listings
    Listing.where(status: 0)