app/models/owned_by_user.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def company_name
   stock = Stock.where(id: self.stock_id)
   Company.where(id: stock.company_id)

SELECT "owned_by_users".* FROM "owned_by_users" WHERE "owned_by_users"."user_id" = ? AND "owned_by_users"."stock_id" = ? LIMIT ?  [["user_id", 2], ["stock_id", 1], ["LIMIT", 1]]
---
  def self.find_user(user, listing)
    return true if OwnedByUser.find_by(
        user_id: user.id,
        stock_id: listing.stock_id
    )

UPDATE "owned_by_users" SET "amount" = ?, "updated_at" = ? WHERE "owned_by_users"."id" = ?  [["amount", 99], ["updated_at", "2020-07-09 22:12:55.583834"], ["id", 1]]
---
  def update_user(user, listing)
    if OwnedByUser.find_user(user, listing)
      record = OwnedByUser.where(user_id: user.id, stock_id: listing.stock_id)

      record.update!(
        user_id: user.id,
        stock_id: listing.stock_id,
        amount: listing.amount,
        purchase_price: listing.price,
        stock_symbol: listing.stock.symbol
      )

INSERT INTO "owned_by_users" ("amount", "created_at", "updated_at", "purchase_price_cents", "user_id", "stock_id") VALUES (?, ?, ?, ?, ?, ?)  [["amount", 4], ["created_at", "2020-07-09 23:05:32.514015"], ["updated_at", "2020-07-09 23:05:32.514015"], ["purchase_price_cents", 4400], ["user_id", 3], ["stock_id", 1]]
SELECT "owned_by_users".* FROM "owned_by_users" WHERE "owned_by_users"."user_id" = ? AND "owned_by_users"."stock_id" = ? LIMIT ?  [["user_id", 2], ["stock_id", 1], ["LIMIT", 1]]
UPDATE "owned_by_users" SET "amount" = ?, "updated_at" = ? WHERE "owned_by_users"."id" = ?  [["amount", 6], ["updated_at", "2020-07-10 22:39:36.129767"], ["id", 2]]
INSERT INTO "owned_by_users" ("amount", "created_at", "updated_at", "purchase_price_cents", "user_id", "stock_id", "stock_symbol") VALUES (?, ?, ?, ?, ?, ?, ?)  [["amount", 8], ["created_at", "2020-07-10 23:08:41.882789"], ["updated_at", "2020-07-10 23:08:41.882789"], ["purchase_price_cents", 800], ["user_id", 1], ["stock_id", 1], ["stock_symbol", "AAPL"]]
---
  def self.create_or_update(user, listing)
    if OwnedByUser.find_user(user, listing)
      byebug
      record = OwnedByUser.find_by(user_id: user.id, stock_id: listing.stock_id)
      byebug
      record.update!(
        amount: record.amount + listing.amount
      )
    end
      byebug
    OwnedByUser.create!(
      user_id: user.id,
      stock_id: listing.stock_id,
      amount: listing.amount,
      purchase_price: listing.price,
      stock_symbol: listing.stock.symbol
    )