app/models/stock.rb

  def self.active_stocks
    Listing.active_listings.map { |l| l.stock }.uniq
---
SELECT "listings".* FROM "listings" WHERE "listings"."stock_id" = ?  [["stock_id", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]