app/models/user.rb

  def self.find_by_credentials(username, password)
    user = User.find_by(username: username)
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "pbateman"], ["LIMIT", 1]]

  def password=(password)
    @password = password
    self.password_digest = BCrypt::Password.create(password)
---
INSERT INTO "users" ("first_name", "last_name", "username", "created_at", "updated_at", "password_digest", "session_token") VALUES (?, ?, ?, ?, ?, ?, ?)

  def reset_session_token!
    self.save!
---
UPDATE "users" SET "updated_at" = ?, "session_token" = ? WHERE "users"."id" = ?  [["updated_at", "2020-07-09 19:56:40.665287"], ["session_token", "agerkgXdanxFKUwLfz92lfWnWu2eB2gKLJPaFSInoXe5KZ8u12B+44M66oXiGylYtkQiK+USk/iQXGnhla6IYw=="], ["id", 1]]

  def stocks
    OwnedByUser.where(user_id: self.id)
---
SELECT "owned_by_users".* FROM "owned_by_users" WHERE "owned_by_users"."user_id" = ? AND "owned_by_users"."id" = ? LIMIT ?  [["user_id", 1], ["id", nil], ["LIMIT", 1]]

  def sell_stock(trade)
    stocks = self.stocks
    stock = stocks.find_or_create_by(stock_id: trade.stock_id)
    updated = stock.amount - trade.num_of_stocks
    stocks.update(stock.id, amount: updated)
---
UPDATE "users" SET "account_balance_cents" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["account_balance_cents", 2000000000], ["updated_at", "2020-07-09 21:31:59.437614"], ["id", 1]]

  def seller_update_account(trade)
    seller = trade.listing.seller
    balance = seller.account_balance
    sold = balance + trade.total_cost_write
    seller.update!(account_balance: sold)
---
UPDATE "users" SET "account_balance_cents" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["account_balance_cents", 920800], ["updated_at", "2020-07-10 03:47:50.524965"], ["id", 3]]

  def buyer_update_account(trade)
    buyer = trade.buyer
    balance = buyer.account_balance
    bought = balance - trade.total_cost_write
    trade.buyer.update(account_balance: bought)
---
UPDATE "users" SET "account_balance_cents" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["account_balance_cents", 1000000], ["updated_at", "2020-07-09 22:41:40.953568"], ["id", 3]]

  def update_account(user, attribute)
    current_balance = user.account_balance
    input = attribute.gsub(/\D/,'').to_i
    monetize = Money.new(input, "USD")
    new_balance = current_balance + monetize
    user.update!(account_balance: new_balance)
---
UPDATE "users" SET "account_balance_cents" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["account_balance_cents", 225200], ["updated_at", "2020-07-10 03:47:22.985995"], ["id", 2]]